Revit 2026 API

# RelinquishOptions Class

---

Options to control behavior of relinquishing ownership of elements and worksets.

SystemObject Autodesk.Revit.DBRelinquishOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RelinquishOptions : IDisposable
```
```vb
Public Class RelinquishOptions
	Implements IDisposable
```
```cpp
public ref class RelinquishOptions : IDisposable
```
```fsharp
type RelinquishOptions =
    class
        interface IDisposable
    end
```

The RelinquishOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RelinquishOptions | Constructs a new instance of RelinquishOptions. |

|  | Name | Description |
| --- | --- | --- |
|  | CheckedOutElements | True means all elements checked out by the current user should be relinquished. False means none of these are relinquished. |
|  | FamilyWorksets | True means all family worksets owned by the current user should be relinquished. False means none of these are relinquished. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StandardWorksets | True means all project standards worksets owned by the current user should be relinquished. False means none of these are relinquished. |
|  | UserWorksets | True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished. |
|  | ViewWorksets | True means all view worksets owned by the current user should be relinquished. False means none of these are relinquished. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RelinquishOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The settings correspond to the checkboxes in the Synchronize with Central dialog in the section "After synchronizing, relinquish the following worksets and elements:".

An element can be owned (reflected in the "Edited By" parameter) either by being checked out ("borrowed") or by belonging to a checked out workset.

Relinquishing a workset will relinquish all its unmodified elements that the current user owns.

The subtle interactions between checking out elements and checking out worksets are beyond the scope of the documentation for this class. But as an example, if a wall is borrowed (explicitly checked out) and then its workset is checked out, then the wall is no longer considered borrowed because the workset ownership implicitly grants ownership of all elements in the workset (except elements borrowed by other users).

#### Reference

Autodesk.Revit.DB Namespace